///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО Фобизнес ПРО
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Найти по произвольному реквизиту элемент справочника
//
// Параметры:
//  Справочник		 - Строка - Наименование справочника в котором требуется найти элемент
//  РеквизитПоиска	 - Строка - Наименование реквизита справочника по которому нужно произвести поиск элемента
//  ЗначениеПоиска	 - Строка - Значение отбора, для поиска элемента справочника
// 
// Возвращаемое значение:
//  СправочникСсылка - Найденный элемент справочника. Тип справочника зависит от переменной "Справочник".
//
Функция НайтиПоПроизвольномуРеквизитуЭлемент(Знач Справочник, Знач РеквизитПоиска, Знач ЗначениеПоиска) Экспорт  
		
	ШаблонТекстаЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	%1 КАК Ссылка
	|ИЗ
	|	%2 КАК %3
	|ГДЕ
	|	%4 = &ЗначениеПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	%5
	|АВТОУПОРЯДОЧИВАНИЕ";	
	ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, Справочник + ".Ссылка", "Справочник." + Справочник, Справочник, Справочник + "." + РеквизитПоиска, РеквизитПоиска);
	
	зЭлементСправочника = Новый Запрос(ТекстЗапроса);
	зЭлементСправочника.УстановитьПараметр("ЗначениеПоиска", ЗначениеПоиска);	
	ВыборкаСправочника = зЭлементСправочника.Выполнить().Выбрать();	
	ВыборкаСправочника.Следующий();
	
	Возврат ВыборкаСправочника.Ссылка;
	
КонецФункции	

#КонецОбласти
