///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО Фобизнес ПРО
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Определить все возможные свойства и настройки методов заложенные в API протокола WITSML
// Из полученной таблицы будут отбираться доступные для нашего сервиса
//
// TODO Перенести в макет, как в УХ - фиксированные группы
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Содержит все методы их свойства и настройки
//
Функция ОпределитьНастройкиМетодов() Экспорт

	тзНастройкиДоступныхПолейМетодов = Новый ТаблицаЗначений();
	тзНастройкиДоступныхПолейМетодов.Колонки.Добавить("Метод"		  		, Новый ОписаниеТипов("Строка"));
	тзНастройкиДоступныхПолейМетодов.Колонки.Добавить("ДоступноеПоле" 		, Новый ОписаниеТипов("Строка"));
	тзНастройкиДоступныхПолейМетодов.Колонки.Добавить("ВозвращаемыйТип"	  	, Новый ОписаниеТипов("Строка"));
	тзНастройкиДоступныхПолейМетодов.Колонки.Добавить("ЭтоИсходящееСвойство", Новый ОписаниеТипов("Булево"));
	тзНастройкиДоступныхПолейМетодов.Колонки.Добавить("ЕстьДоступПоля"		, Новый ОписаниеТипов("Булево"));
	тзНастройкиДоступныхПолейМетодов.Колонки.Добавить("ЭтоXMLОтвет"			, Новый ОписаниеТипов("Булево"));
	тзНастройкиДоступныхПолейМетодов.Колонки.Добавить("ЭтоОписаниеОшибки"	, Новый ОписаниеТипов("Булево"));
	
	#Область Метод_WMLS_GetVersion
	
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetVersion";
		НоваяНастройка.ДоступноеПоле = Неопределено;
		НоваяНастройка.ВозвращаемыйТип    = "Строка";
		НоваяНастройка.ЭтоИсходящееСвойство= Неопределено;
		НоваяНастройка.ЕстьДоступПоля= Ложь;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
	
	#КонецОбласти
	
	#Область Метод_WMLS_GetCap
	
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetCap";
		НоваяНастройка.ДоступноеПоле = "OptionsIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetCap";
		НоваяНастройка.ДоступноеПоле = "CapabilitiesOut";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Ложь;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Истина;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetCap";
		НоваяНастройка.ДоступноеПоле = "SuppMsgOut";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Ложь;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Истина;
	
	#КонецОбласти
	
	#Область Метод_WMLS_DeleteFromStore
	
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_DeleteFromStore";
		НоваяНастройка.ДоступноеПоле = "WMLtypeIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_DeleteFromStore";
		НоваяНастройка.ДоступноеПоле = "QueryIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_DeleteFromStore";
		НоваяНастройка.ДоступноеПоле = "OptionsIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_DeleteFromStore";
		НоваяНастройка.ДоступноеПоле = "CapabilitiesIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_DeleteFromStore";
		НоваяНастройка.ДоступноеПоле = "SuppMsgOut";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Ложь;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Истина;
	
	#КонецОбласти
	
	#Область Метод_WMLS_AddToStore
	
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_AddToStore";
		НоваяНастройка.ДоступноеПоле = "WMLtypeIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_AddToStore";
		НоваяНастройка.ДоступноеПоле = "XMLin";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_AddToStore";
		НоваяНастройка.ДоступноеПоле = "OptionsIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_AddToStore";
		НоваяНастройка.ДоступноеПоле = "CapabilitiesIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_AddToStore";
		НоваяНастройка.ДоступноеПоле = "SuppMsgOut";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Ложь;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Истина;
	
	#КонецОбласти
	
	#Область Метод_WMLS_GetFromStore
	
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetFromStore";
		НоваяНастройка.ДоступноеПоле = "WMLtypeIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetFromStore";
		НоваяНастройка.ДоступноеПоле = "QueryIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetFromStore";
		НоваяНастройка.ДоступноеПоле = "OptionsIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetFromStore";
		НоваяНастройка.ДоступноеПоле = "CapabilitiesIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetFromStore";
		НоваяНастройка.ДоступноеПоле = "XMLout";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Ложь;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Истина;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetFromStore";
		НоваяНастройка.ДоступноеПоле = "SuppMsgOut";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Ложь;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Истина;
	
	#КонецОбласти
	
	#Область Метод_WMLS_UpdateInStore
	
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_UpdateInStore";
		НоваяНастройка.ДоступноеПоле = "WMLtypeIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_UpdateInStore";
		НоваяНастройка.ДоступноеПоле = "XMLin";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_UpdateInStore";
		НоваяНастройка.ДоступноеПоле = "OptionsIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_UpdateInStore";
		НоваяНастройка.ДоступноеПоле = "CapabilitiesIn";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
		
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_UpdateInStore";
		НоваяНастройка.ДоступноеПоле = "SuppMsgOut";
		НоваяНастройка.ВозвращаемыйТип      = "Число";
		НоваяНастройка.ЭтоИсходящееСвойство= Ложь;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Истина;
	
	#КонецОбласти
	
	#Область Метод_WMLS_GetBaseMsg
	
		НоваяНастройка = тзНастройкиДоступныхПолейМетодов.Добавить();
		НоваяНастройка.Метод         = "WMLS_GetBaseMsg";
		НоваяНастройка.ДоступноеПоле = "ReturnValueIn";
		НоваяНастройка.ВозвращаемыйТип      = "Строка";
		НоваяНастройка.ЭтоИсходящееСвойство= Истина;
		НоваяНастройка.ЕстьДоступПоля= Истина;
		НоваяНастройка.ЭтоXMLОтвет = Ложь;
		НоваяНастройка.ЭтоОписаниеОшибки = Ложь;
	
	#КонецОбласти
	
	Возврат тзНастройкиДоступныхПолейМетодов;
	
КонецФункции

#КонецОбласти
