///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО Фобизнес ПРО
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Определить все возможные свойства и настройки методов заложенные в API протокола WITSML
// Из полученной таблицы будут отбираться доступные для нашего сервиса
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Содержит все методы их свойства и настройки
//
Функция ОпределитьНастройкиМетодов() Экспорт
	
	тзНастройкиДоступныхПолейМетодов = Новый ТаблицаЗначений;
	
	Макет = ПолучитьОбщийМакет("РаботаСGTIOnlineМакет");
	
	Если Макет.Области.Количество() = 0 Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Не найден макет заполнения для работы с GTI-Online.'"), 
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.ОбщиеМакеты.РаботаСGTIOnlineМакет);
		
		Возврат тзНастройкиДоступныхПолейМетодов;
		
	КонецЕсли;
	
	ПостроительОтчета = Новый ПостроительОтчета;                                    
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Области[0]);
	ПостроительОтчета.Выполнить();
	тзНастройкиДоступныхПолейМетодов = ПостроительОтчета.Результат.Выгрузить();
	
	Возврат тзНастройкиДоступныхПолейМетодов;
	
КонецФункции

#КонецОбласти
