
#Область СобытияФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СкрытьПараметрыМетода();
	
КонецПроцедуры

&НаКлиенте
Процедура Инициализация(Команда)
	
	ВыполнитьМетод_ПоКоманде();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	ВыполнитьМетод_ПоКоманде();
				
КонецПроцедуры

&НаКлиенте
Процедура МетодПриИзменении(Элемент)
	
	СкрытьПараметрыМетода();
	ОчиститьРезультатыНаФорме();
	ДобавитьРеквизитыПараметровМетодаНаФорму_НаСервере(Элемент.ВыделенныйТекст);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьМетод_ПоКоманде()
	
	ПараметрыМетода = ИнициализироватьОбязательнуюСтруктуруМетода();
	ДобавитьПараметрыМетода(ПараметрыМетода);
	
	Результат = РаботаСGTIOnline.ВыполнитьМетод(ПараметрыМетода);
		
	Если Результат.Успешно = 0 Тогда 
		
		Элементы.ГруппаОсновная.Доступность = Ложь;
		
		Метод = "WMLS_GetCap";
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не предсказуемая ошибка работы с GTIONLINE' "
		+ "; en = 'Unpredictable error with GTIONLINE' ");
		Сообщение.Сообщить();
		
	ИначеЕсли Результат.Успешно = 1 Тогда  
		
		Элементы.ГруппаОсновная.Доступность = Истина;	
		
		РаботаСGTIOnline.ПрочитатьРезультат(Результат);
		
	ИначеЕсли Результат.Успешно = "Function completed successfully" Тогда 	
		
		Элементы.ГруппаОсновная.Доступность = Истина;
			
	КонецЕсли;
	
	ВывестиРезультатВыполненияМетодаНаФорму(Результат);
	
	Если Метод = "WMLS_GetCap" Тогда 
		ВывестиДоступныеМетодыНаФорму(Результат);		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Функция ИнициализироватьОбязательнуюСтруктуруМетода()

	ПараметрыМетода = Новый Структура("ИмяМетода, Логин, Пароль", Метод, Логин, Пароль);
	Возврат ПараметрыМетода
	
КонецФункции
	
&НаКлиенте
Процедура СкрытьПараметрыМетода()
	
	Для Каждого ЭлементФормы Из Элементы.ГруппаПараметрыМетода.ПодчиненныеЭлементы Цикл 
		ЭлементФормы.Видимость = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРезультатыНаФорме()

	РезультатЗапроса = "";
	Ошибка = "";

КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыПараметровМетодаНаФорму_НаСервере(ИмяМетода)
	
	тзНастройкиДоступныхПолейМетодов = РаботаСGTIOnlineПовтИсп.ОпределитьНастройкиМетодов();
	СтрокиНастройки = тзНастройкиДоступныхПолейМетодов.НайтиСтроки(Новый Структура("Метод", ИмяМетода));
	Для Каждого СтрокаНастройки из СтрокиНастройки Цикл 
		Если СтрокаНастройки.ЭтоИсходящееСвойство Тогда 	
						
			Элементы[СтрокаНастройки.ДоступноеПоле].Видимость = Истина;
						
		КонецЕсли;		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметрыМетода(ПараметрыМетода)

	Для Каждого ЭлементФормы Из Элементы.ГруппаПараметрыМетода.ПодчиненныеЭлементы Цикл 
		Если ЭлементФормы.Видимость Тогда 
			ПараметрыМетода.Вставить(ЭлементФормы.Имя, ЭлементФормы.ТекстРедактирования);
		КонецЕсли;	
	КонецЦикла;		
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ВывестиРезультатВыполненияМетодаНаФорму(Результат)
	
	Если Метод = "WMLS_GetVersion" Тогда 
		РезультатЗапроса = Результат.Успешно;
		
	ИначеЕсли Метод = "WMLS_GetBaseMsg" Тогда 
		РезультатЗапроса = Результат.Успешно;
		
	Иначе 	

		Если Результат.Свойство("СтрокаXMLОтвета") Тогда 
			Результат.Свойство(Результат.СтрокаXMLОтвета, РезультатЗапроса);	
		КонецЕсли;	
		
		Если Результат.Свойство("СтрокаПоляОшибки") Тогда 
			Результат.Свойство(Результат.СтрокаПоляОшибки, Ошибка);
		КонецЕсли;
	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДоступныеМетодыНаФорму(Результат)
	
	Элементы.Метод.СписокВыбора.Очистить();
	Элементы.WMLtypeIn.СписокВыбора.Очистить();
	
	ПредыдущаяФункция = Неопределено;
	Для Каждого Свойство Из Результат.таблицаСвойстваWSDL Цикл 
		
		Если Свойство.Функция = "WMLS_GetFromStore" Тогда	
			Элементы.WMLtypeIn.СписокВыбора.Добавить(Свойство.ОбъектДанных);
		КонецЕсли;
		
		Если ПредыдущаяФункция <> Свойство.Функция Тогда 
	    	Элементы.Метод.СписокВыбора.Добавить(Свойство.Функция);
			ПредыдущаяФункция = Свойство.Функция;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область Инициализация

Если ПустаяСтрока(Метод) Тогда 
	Метод = "WMLS_GetCap";
КонецЕсли;

#КонецОбласти